fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокДоговоровИРеализаций</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Реализация</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
    Объект.Период.ДатаНачала = НачалоМесяца(ДобавитьМесяц(ТекущаяДатаСеанса(), -1));
	Объект.Период.ДатаОкончания = КонецМесяца(ДобавитьМесяц(ТекущаяДатаСеанса(), -1));
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Период) И (Объект.Период.ДатаНачала <> НачалоМесяца(Объект.Период.ДатаНачала) 
	    ИЛИ Объект.Период.ДатаОкончания <> КонецМесяца(Объект.Период.ДатаОкончания)) Тогда
		
		Объект.Период.ДатаНачала = НачалоМесяца(Объект.Период.ДатаНачала);
		Объект.Период.ДатаОкончания = КонецМесяца(Объект.Период.ДатаОкончания);
		
		ТекстСообщения = СтрШаблон("Период обработки изменен кратно месяцу: %1 - %2", Объект.Период.ДатаНачала, Объект.Период.ДатаОкончания);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,"Объект.Период");
	
	КонецЕсли;
Объект.СписокДоговоровИРеализаций.Очистить();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции	

&НаКлиенте
Процедура СоздатьДокументы(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.Период) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Заполните период создания актов реализации товаров и услуг.
		|Обработка не запущена!",,"Объект.Период");
		Возврат;
	КонецЕсли;
	Если КонецМесяца(Объект.Период.ДатаНачала) <> КонецМесяца(Объект.Период.ДатаОкончания) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Период создания актов реализации товаров и услуг должен быть кратен месяцу.
		                                            |Обработка не запущена!",,"Объект.Период");
		Возврат;
	КонецЕсли;
	
	ДлительнаяОперация = СоздатьДокументыНаСервере();
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.Вставить("ВыводитьСообщения", Истина);
	Оповещение = Новый ОписаниеОповещения("ПолучитьСписокДокументов", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);
КонецПроцедуры	

&НаСервере
Функция СоздатьДокументыНаСервере()
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, "Обработки.ВКМ_МассовоеСозданиеАктов.СоздатьСписокДокументовРеализацииТоваровИУслуг", 
	                                                                  Объект.Период.ДатаНачала, Объект.Период.ДатаОкончания);
КонецФункции


&НаКлиенте
Процедура ПолучитьСписокДокументов(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат.Статус = "Ошибка" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);
	Возврат;
	КонецЕсли;
	
	Если Результат = Неопределено Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Обработка отменена пользователем");
		Возврат;
	КонецЕсли;
	РезультатОбработки = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	
	Если РезультатОбработки = Неопределено Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не удалось получить результат обработки");
		Возврат;
	КонецЕсли;
	
	Объект.СписокДоговоровИРеализаций.Очистить();
	Если РезультатОбработки.ДокументовСоздано = 0 И РезультатОбработки.ДокументовНеСоздано = 0 Тогда
		ТекстСообщения = "Для выбранного периода не найдено документов реализации по абонетским договорам, или нет действующих договоров";
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		
		Возврат;
		
	КонецЕсли;
	

    ЗаписатьСписокДокументов(РезультатОбработки.МассивДоговоровИРеализаций);
	
	
	ТекстСообщения = СтрШаблон("Для выбранного периода создано %1 документов, не создано %2 документов", РезультатОбработки.ДокументовСоздано, РезультатОбработки.ДокументовНеСоздано);
	ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьСписокДокументов(МассивСписка)
	
	Если МассивСписка = Неопределено ИЛИ ТипЗнч(МассивСписка) <> Тип("Массив") Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ЭлементМассива Из МассивСписка Цикл
		НоваяСтрока = Объект.СписокДоговоровИРеализаций.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементМассива);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
